{
  "5.51.93": [],
  "5.51.111": [
    "return an error if an operator is defined as passthrough and not passthrough"
  ],
  "5.51.12": [
    "Added a new function to Generator, gs(g, contexts, separator, last_separator). It will take an array and return a string of the form 'a, b, c and d'. Where g is the g function; contexts is a list of contexts, separator is the ', ' and last_separator is ' and '. If last_separator is not specified its the value of separator. If separator is not specified it defaults to ' '"
  ],
  "5.51.132": [
    "For semantics and generators, use 'objects' instead of 'global'"
  ],
  "5.51.91": [],
  "5.51.171": [
    "update the api to support namespaces",
    "make ekms so it can run without including entodicton",
    "add object references to the patterns. for example ((amount/0) [currency])."
  ],
  "5.51.95": [],
  "5.51.83": [
    "For passthrough operators the operator to use as the results can be marked with a '*'. For example in (*([property]) <of> ([value])), 'of' is a passthrough infix operator the operand marked with a '*' will be used as the result of the expression."
  ],
  "5.51.105": [
    "add api for testing configs"
  ],
  "5.51.115": [
    "add Digraph class to client code"
  ],
  "5.51.94": [],
  "5.51.107": [
    "In the bridges 'operator' used to be an array. Now it is not.",
    "Added a bunch of more detailed error messages"
  ],
  "5.51.116": [
    "change from 'global' to 'objects' in the generators and selectors"
  ],
  "6.10.4-beta.2": [
    "updated the type inference"
  ],
  "5.51.92": [
    "Added helper functions into the client. 'const processContexts = (contexts, params)' and 'const processContext = (contexts, params)'. Params is '{ objects = {}, generators = [], semantics = [] }'. They will run semantics on the given context or contexts without calling the server"
  ],
  "5.51.76": [
    "When calling process you can set the contexts property in the config. Then the utterances will be ignored and just the contexts provided will be run through the semantics and the generators'"
  ],
  "5.51.130": [
    "update the data generation algorithms for the neural nets"
  ],
  "5.51.90": [
    "The SDK will return errors as JSON instead of a string. 'status' is the http status. 'error' is the text."
  ]
}